In [14]:
from sqlalchemy import create_engine
import mysql.connector
import pandas as pd


conn = "mysql+mysqlconnector://root:cUny$p$_7@localhost:3306/Chinook"

engine = create_engine(conn)

connection = engine.connect()

In [15]:
sql_query = ("SELECT \
                Customer.LastName AS 'First_Name', \
                Customer.FirstName AS 'Last_Name', \
                Track.Name AS 'Song_Title', \
                Album.Title AS 'Album_Title' \
                FROM Customer \
                JOIN Invoice \
                    ON Customer.CustomerId = Invoice.CustomerId \
                JOIN InvoiceLine \
                    ON Invoice.InvoiceId = InvoiceLine.InvoiceId \
                JOIN Track \
                    ON InvoiceLine.TrackId = Track.TrackId \
                JOIN Album \
                    ON Track.AlbumId = Album.AlbumId \
                ORDER BY Customer.LastName, Album.Title, Track.Name")

# Read the SQL query into a pandas dataframe
Cust_Purchases_df = pd.read_sql(sql_query, conn)

Cust_Purchases_df.head()

  First_Name Last_Name               Song_Title    Album_Title
0    Almeida   Roberto        Burden In My Hand        A-Sides
1    Almeida   Roberto                   Flower        A-Sides
2    Almeida   Roberto        Jesus Christ Pose        A-Sides
3    Almeida   Roberto  The Day I Tried To Live        A-Sides
4    Almeida   Roberto                    Dance  Ace Of Spades